var app = angular.module('app', ['ngTouch', 'ui.grid']);
 
app.controller('MainCtrl', ['$scope', function ($scope) {
 
  $scope.myData = [
    {
		"Статус":"Самовывоз",
		"№":2345,
		"Заказчик":"Анна",
		"Дата":"22. 05. 2016",
		"Сумма, руб":1400,
		" ":"tool"
    },
    {
        "Статус":"Самовывоз",
		"№":45,
		"Заказчик":"Юлия",
		"Дата":"21. 05. 2016",
		'Сумма, руб':230,
		" ":"tool"
    },
    {
        "Статус":"Отменен",
		"№":21,
		"Заказчик":"Петр",
		"Дата":"21. 05. 2016",
		"Сумма, руб":4500,
		" ":"tool"
    },
    {
        "Статус":"Готов к выдаче",
		"№":3,
		"Заказчик":"Константин",
		"Дата":"20. 05. 2016",
		"Сумма, руб":12000,
		" ":"tool"
    },
	{
		"Статус":"Самовывоз",
	    "№":689,
		"Заказчик":"Сергей",
		"Дата":"20. 05. 2016",
		"Сумма, руб":3000,
		" ":"tool"
    }
];
}]);